# -*- coding: utf-8 -*-

#To be used in 2nd version
# idx2emoji = {
#     'smiling': "😁|😃|😄|🙂|🙃|😸",
#     'laughing': "😂|🤣|😅|😆|😹",
#     'winking': "😉",
#     'angel': "😇",
#     'blushing': "😊|☺",
#     'liplicking': "😋",
#     'calm_smiling': "😌",
#     'inlove': "😍|😻|💖|❤",
#     'kissing': "😘|😗|😙|😚|😽",
#     'playful_tongue_out': "😜|😝|😛",
#     'puking_money': "🤑",
#     'sun_glasses': "😎",
#     'nerd_glasses': "🤓",
#     'excited_hands_shaking': "🤗",
#     'smirking': "😏|😼",
#     'unamused': "😐|😑|😒|🙄",
#     'thinking': "🤔",
#     'preying':"🙏",
#     'fire':"🔥",
#     'pale': "😳|😤",
#     'sad': "😞|😟|😔|😕|🙁|☹|😣|😖|😫|😩|😰|😦|😧|🙀",
#     'crying': "😢|😥|😪|😭|😿",
#     'mad': "😠|😡|😾|🤬",
#     'shock': "😮|😱|😨|😯|😲",
#     'hungry': "🤤",
#     'satisfied': "👍|👌|✌|✌️",
#     'fucked_up_face': "😵|🤪",
#     'speak_no_evil': '🤐|🙊',
#     'wounded_face': '🤕',
#      'doctor_face': '😷',
#     'vomit_face': '🤢',
#     'cold_sweat': "😓",
#     'sick': '🤒|🤧|🤮',
#     'sleepy': '😴|💤',
#     'devil': '😈|👿|👹',
#     'exhausted': "😫",
#     'eyebrow': "🤨",
#     'stary_eyes': "🤩",
#     'secret_laughing': "🤭"
# }

# This is common version
# idx2emoji = {
#     'smiling': "😁|😃|😄|🙂|🙃|😸",
#     'laughing': "😂|🤣|😅|😆|😹",
#     'winking': "😉",
#
#     'angel': "😇",
#
#     'blushing': "😊|☺",
#     'liplicking': "😋", #5
#     'calm_smiling': "😌",
#     'inlove': "😍|😻|💖|❤",
#     'kissing': "😘|😗|😙|😚|😽",
#     'playful_tongue_out': "😜|😝|😛",
#     # 'puking_money': "🤑", #10  # 186000 ~
#     'sun_glasses': "😎",
#     'nerd_glasses': "🤓",  # 240000~
#     'excited_hands_shaking': "🤗",
#     'sneeky_face': "😏|😼",
#     'straight_face': "😐|😑|😒|🙄", #15
#     'thinking': "🤔",
#     # 'hassing' :"\\U0001f92b",
#     # 'lying' : "🤥",#55000~
#     'pale_face': "😳|😤",
#     'sad_face': "😞|😟|😔|😕|🙁|☹|😣|😖|😫|😩|😰|😦|😧|🙀", #20
#     'crying_face': "😢|😥|😪|😭|😿",
#     'mad_face': "😠|😡|😾|🤬",   # Rem
#     'shock_face': "😮|😱|😨|😯|😲",
#     'hungry_face': "🤤",  # ~467837
#
#     # 'fucked_up_face': "😵|\\U0001f92a",
#     # 'zip_face': '🤐',
#     # 'wounded_face': '🤕',
#     # 'doctor_face': '😷',
#
#     # 'vomit_face': '🤢',
#
#     'sweat_drop_face': "😓",  # 25
#     'sick_face': '🤒|🤧|🤮',  # 30 # Remove
#     'sleepy': '😴|💤',   # Remove
#     'devil_face': '😈|👿|👹' ,
#     'exhausted': "😫",
#     'eyebrow': "🤨",
#     'stary_eyes': "🤩"
#
#     # 'laughing_not_sure': "🤭"
#
# }

idx2emoji = {
    # TODO: To be added
    # 'broken_heart': "💔",
    # 'laughing_not_sure': "🤭"

    'smiling': "😁|😃|😄|🙂|🙃|😸",
    'laughing': "😂|🤣|😅|😆|😹",
    'winking': "😉",
    'angel': "😇",
    'blushing': "😊|☺",
    'liplicking': "😋", #5
    'relieved': "😌",
    'heart' : "💖|❤",
    'inlove': "😍|😻",
    'kissing': "😘|😗|😙|😚|😽",
    'playful_tongue_out': "😜|😝|😛",
    # 'puking_money': "🤑", #10  # 186000 ~
    'sun_glasses': "😎",
    'nerd_glasses': "🤓",  # 240000~
    'excited_hands_shaking': "🤗",
    'sneeky_face': "😏|😼",
    'straight_face': "😐|😑|😒|🙄", #15
    'thinking': "🤔",
    # 'hassing' :"\\U0001f92b",
    # 'lying' : "🤥",#55000~
    'pale_face': "😳",
    # 'triumph'  : "😤",
    'sad_face': "😞|😟|😔|😕|🙁|☹|😦|😧", #20
    'crying_face': "😢|😥|😭|😿",
    'mad_face': "😠|😡|😾|🤬|😣|😖",   # Rem
    'shock_face': "😮|😱|😨|😯|😲|🙀",
    'hungry_face': "🤤",  # ~467837

    # 'fucked_up_face': "😵|\\U0001f92a",
    # 'zip_face': '🤐',
    # 'wounded_face': '🤕',
    # 'doctor_face': '😷',
    # 'vomit_face': '🤢',

    'sweat_drop_face': "😓|😰",
    'sick_face': '🤒|🤧|🤮',
    'sleepy': '😴|💤|😪',
    'devil_face': '😈|👿|👹' ,
    'weary': "😫|😩|😫",
    'eyebrow': "🤨",
    'stary_eyes': "🤩"

}

idx2emoji = {'0': '😳|😵', '1': '🤓', '2': '😴|💤', '3': '😮|😱|😯|😲|😨|🙀', '4': '😟|☹|😦|😧', '5': '😣|😖|😓|😰', '6': '💔', '7': '😞|🙁|😢|😥|😿', '8': '🤒', '9': '🙏', '10': '🙊', '11': '✌|👍|👌', '12': '🤔|\U0001f928', '13': '😗', '14': '😜|😝|😛|😼', '15': '😐|😕', '16': '😁|😄|😸|😉', '17': '😅', '18': '😎|😏|😈', '19': '💖|❤', '20': '🤣|😆', '21': '😍|😻|😘|😙|😚|😽', '22': '🔥', '23': '😃', '24': '😫|😩|😫', '25': '😇|😌', '26': '😹|\U0001f92d|😂', '27': '😾|👿|😠|😡|\U0001f92c', '28': '😭', '29': '😤|😔|🤧|😪', '30': '😑|😒|🙄', '31': '🙃|☺|🙂', '32': '\U0001f92a|\U0001f929', '33': '😊|🤗', '34': '😋|🤤', '35': '🤢|\U0001f92e'}
